In [34]:
import pandas as pd
df = pd.read_excel('05.xlsx',sheet_name=0)
df

   ID号  姓名 性别  语文  数学  英语
0  ID1  陈一  男  81  94  61
1  ID2  徐二  女  82  88  87
2  ID3  张三  男  83  99  99
3  ID4  李四  女  84  67  77
4  ID5  王五  男  85  88  79
5  ID6  罗六  女  86  69  96
6  ID7  安七  男  87  77  84

In [35]:
# 筛选单双数行
df[df.index%2==1]

   ID号  姓名 性别  语文  数学  英语
1  ID2  徐二  女  82  88  87
3  ID4  李四  女  84  67  77
5  ID6  罗六  女  86  69  96

In [36]:
df[df.index%2==0]

   ID号  姓名 性别  语文  数学  英语
0  ID1  陈一  男  81  94  61
2  ID3  张三  男  83  99  99
4  ID5  王五  男  85  88  79
6  ID7  安七  男  87  77  84

In [37]:
# 筛选男生女生
df[df['性别']=='男']

   ID号  姓名 性别  语文  数学  英语
0  ID1  陈一  男  81  94  61
2  ID3  张三  男  83  99  99
4  ID5  王五  男  85  88  79
6  ID7  安七  男  87  77  84

In [38]:
df[df['性别']=='女']

   ID号  姓名 性别  语文  数学  英语
1  ID2  徐二  女  82  88  87
3  ID4  李四  女  84  67  77
5  ID6  罗六  女  86  69  96

In [39]:
# 筛选数学大于90
df[df['数学']>=90]

   ID号  姓名 性别  语文  数学  英语
0  ID1  陈一  男  81  94  61
2  ID3  张三  男  83  99  99

In [40]:
df[df['英语']>=90]

   ID号  姓名 性别  语文  数学  英语
2  ID3  张三  男  83  99  99
5  ID6  罗六  女  86  69  96

In [41]:
# 分数+性别
df[(df['语文']>=83) & (df['性别']=='女')]

   ID号  姓名 性别  语文  数学  英语
3  ID4  李四  女  84  67  77
5  ID6  罗六  女  86  69  96

In [42]:
df[(df['语文']>83) | (df['性别']=='女')]

   ID号  姓名 性别  语文  数学  英语
1  ID2  徐二  女  82  88  87
3  ID4  李四  女  84  67  77
4  ID5  王五  男  85  88  79
5  ID6  罗六  女  86  69  96
6  ID7  安七  男  87  77  84

In [43]:
# # TODO: 整列修改
# df['语文'] = df['语文']+10
# df

In [44]:
# df['数学'] = [99,99,99,99,99,99,99]
# df

In [48]:
# eq()函数
df[df['性别'] == '男']

   ID号  姓名 性别  语文  数学  英语
0  ID1  陈一  男  81  94  61
2  ID3  张三  男  83  99  99
4  ID5  王五  男  85  88  79
6  ID7  安七  男  87  77  84

In [49]:
df[df['性别'].eq('女')]

   ID号  姓名 性别  语文  数学  英语
1  ID2  徐二  女  82  88  87
3  ID4  李四  女  84  67  77
5  ID6  罗六  女  86  69  96